//
// Do NOT modify or remove this copyright and license
//
// Copyright (c) 2012 - 2018 Seagate Technology LLC and/or its Affiliates, All Rights Reserved
//
// This software is subject to the terms of the Mozilla Public
// License, v. 2.0. If a copy of the MPL was not distributed with this
// file, You can obtain one at http://mozilla.org/MPL/2.0/.
//
// ******************************************************************************************
// \file common.h
// \brief Defines the constants structures and function headers that are common to OS & Non-OS code.


#pragma once

#include "common.h"
#include "version.h"
#if defined (VMK_CROSS_COMP)
#include "vm_nvme_lib.h"
#endif
#if defined (UEFI_C_SOURCE)
#include <Protocol/ScsiPassThruExt.h> //for TARGET_MAX_BYTES definition
#include <Protocol/DevicePath.h> //for device path union/structures
#endif

#if defined (__cplusplus)
#define __STDC_FORMAT_MACROS
extern "C"
{
#endif

    //This is a bunch of stuff for creating opensea-transport as a dynamic library (DLL in Windows or shared object in linux)
    #if defined(OPENSEA_TRANSPORT_API)
        #undef(OPENSEA_TRANSPORT_API)
    #endif

    #if defined(_WIN32) //DLL/LIB....be VERY careful making modifications to this unless you know what you are doing!
        #if defined (EXPORT_OPENSEA_TRANSPORT) && defined(STATIC_OPENSEA_TRANSPORT)
            #error "The preprocessor definitions EXPORT_OPENSEA_TRANSPORT and STATIC_OPENSEA_TRANSPORT cannot be combined!"
        #elif defined(STATIC_OPENSEA_TRANSPORT)
            #pragma message("Compiling opensea-transport as a static library!")
            #define OPENSEA_TRANSPORT_API
        #elif defined(EXPORT_OPENSEA_TRANSPORT)
            #pragma message("Compiling opensea-transport as exporting DLL!")
            #define OPENSEA_TRANSPORT_API __declspec(dllexport)
        #elif defined(IMPORT_OPENSEA_TRANSPORT)
            #pragma message("Compiling opensea-transport as importing DLL!")
            #define OPENSEA_TRANSPORT_API __declspec(dllimport)
        #else
            #error "You must specify STATIC_OPENSEA_TRANSPORT or EXPORT_OPENSEA_TRANSPORT or IMPORT_OPENSEA_TRANSPORT in the preprocessor definitions!"
        #endif
    #else //SO/A....as far as I know, nothing needs to be done here
        #define OPENSEA_TRANSPORT_API
    #endif

    #define SEAGATE_VENDOR_ID       (0x1BB1)

    #define OPENSEA_MAX_CONTROLLERS (8U)
    #define MAX_DEVICES_PER_CONTROLLER (256U)
    #define MAX_DEVICES_TO_SCAN (OPENSEA_MAX_CONTROLLERS * MAX_DEVICES_PER_CONTROLLER)

    #define SERIAL_NUM_LEN          (20) //Going with ATA lengths
    #define MODEL_NUM_LEN           (40)
    #define FW_REV_LEN              (10)
    #define T10_VENDOR_ID_LEN       (8)

    typedef struct _apiVersionInfo 
    {
        uint8_t majorVersion;
        uint8_t minorVersion;
        uint8_t patchVersion; 
        uint8_t reserved; 
    } apiVersionInfo;

// These need to be moved to ata_helper.h
    #if !defined (__GNUC__) || defined (__MINGW32__) || defined (__MINGW64__)
    #pragma pack(push, 1)
    #endif
    typedef struct
    {
        union {
            uint16_t Config; //This has to be firs
            uint16_t Word000;
        };
        union {
            uint16_t DefCyln;
            uint16_t Word001;
        };
        union {
            uint16_t Resv1;
            uint16_t Word002;
        };
        union {
            uint16_t DefHead;
            uint16_t Word003;
        };
        uint16_t Word004;
        uint16_t Word005;
        union {
            uint16_t DefSector;
            uint16_t Word006;
        };
        uint16_t Word007;
        uint16_t Word008;
        uint16_t Word009;

        uint8_t  SerNum[20];

        uint16_t Word020;
        union {
            uint16_t BufSize;           // 21
            uint16_t Word021;
        };
        union {
            uint16_t RWLongByte;        // 22
            uint16_t Word022;
        };
        uint8_t  FirmVer[8];        // 23 24 25 26
        uint8_t  ModelNum[40];      // 27 ... 46
        union {
            uint8_t  BLK_SIZE[2];       // 47
            uint16_t Word047;
        };
        union {
            uint16_t DoubleWordIO;      // 48
            uint16_t Word048;
        };
        union {
            uint16_t Capability;        // 49
            uint16_t Word049;
        };

        uint16_t Word050;
        union {
            uint16_t PIOCycleTimeMode;  // 51
            uint16_t Word051;
        };
        union {
            uint16_t DMACycleTimeMode;  // 52
            uint16_t Word052;
        };
        union {
            uint16_t ValidWord;         // 53
            uint16_t Word053;
        };
        union {
            uint16_t CurCyln;           // 54
            uint16_t Word054;
        };
        union {
            uint16_t CurHead;           // 55
            uint16_t Word055;
        };
        union {
            uint16_t CurSector;         // 56
            uint16_t Word056;
        };
        uint32_t TotSectNumCHS;     // 57 58
        union {
            uint16_t MultiSectNum;      // 59
            uint16_t Word059;
        };

        uint32_t TotSectNumLBA;     // 60 61
        union {
            uint16_t SingleDMAMode;     // 62
            uint16_t Word062;
        };
        union {
            struct {
                uint8_t  MwDmaModesSupported;
                uint8_t  MultiDMAMode; // 63
            }mwdmaInfo;
            uint16_t Word063;
        };
        union {
            uint16_t AdvanPIOMode;      // 64
            uint16_t Word064;
        };
        union {
            uint16_t MinDMACycleTime;      // 65
            uint16_t Word065;
        };
        union {
            uint16_t RecDMACycleTime;      // 66
            uint16_t Word066;
        };
        union {
            uint16_t MinPIOCycleTime;      // 67
            uint16_t Word067;
        };
        union {
            uint16_t MinPIOCycleTimeIORDY; // 68
            uint16_t Word068;
        };
        uint16_t Word069;

        uint16_t Word070;
        uint16_t Word071;
        uint16_t Word072;
        uint16_t Word073;
        uint16_t Word074;
        union {
            uint16_t MaxQueueTag; // 75, bits 0-4 only
            uint16_t Word075;
        };
        union {
            uint16_t SataCapabilities; // 76
            uint16_t Word076;
        };
        uint16_t Word077;
        uint16_t Word078;
        uint16_t Word079;

        uint16_t Word080;
        uint16_t Word081;
        union {
            uint16_t CommandsAndFeaturesSupported1; // 82
            uint16_t Word082;
        };
        union {
            uint16_t CommandsAndFeaturesSupported2; // 83
            uint16_t Word083;
        };
        union {
            uint16_t CommandsAndFeaturesSupported3; // 84
            uint16_t Word084;
        };
        union {
            uint16_t CommandsAndFeaturesEnabled1;   // 85
            uint16_t Word085;
        };
        union {
            uint16_t CommandsAndFeaturesEnabled2;   // 86
            uint16_t Word086;
        };
        union {
            uint16_t CommandsAndFeaturesEnabled3;   // 87
            uint16_t Word087;
        };
        union {
            struct {
                uint8_t  UDmaModesSupported;
                uint8_t  UDmaMode; // 88
            }udmaModeInfo;
            uint16_t Word088;
        };
        uint16_t Word089;

        uint16_t Word090;
        uint16_t Word091;
        uint16_t Word092;
        uint16_t Word093;
        uint16_t Word094;
        uint16_t Word095;
        uint16_t Word096;
        uint16_t Word097;
        uint16_t Word098;
        uint16_t Word099;


        //Both Changed from tUINT32 to 16
        uint32_t TotSectNumLBALo;
        uint32_t TotSectNumLBAHi;

        uint16_t Word104;
        uint16_t Word105;
        //union {  // 106
        //   uint16_t AsWord;
        //   struct  {
        //      uint16_t LogicalSectorCount:4; // Bits 0-3
        //      uint16_t Reserved4_11:8;       // Bits 4-11
        //      uint16_t LargeSectors:1;       // Bit 12
        //      uint16_t LogicalSectors:1;     // Bit 13
        //      uint16_t FeatureSupport:2;     // Bits 14-15
        //   } bitfields;
        //} SectorSizeReport;
        // Commentedout the above because of portability issues with bit fields.
        union {
            uint16_t SectorSizeReport;
            uint16_t Word106;
        };
        uint16_t Word107;
        uint16_t Word108;
        uint16_t Word109;

        uint16_t Word110;
        uint16_t Word111;
        uint16_t Word112;
        uint16_t Word113;
        uint16_t Word114;
        uint16_t Word115;
        uint16_t Word116;
        uint16_t SectorSize[2]; // 117-118
        uint16_t Word119;

        uint16_t Word120;
        uint16_t Word121;
        uint16_t Word122;
        uint16_t Word123;
        uint16_t Word124;
        uint16_t Word125;
        uint16_t Word126;
        uint16_t Word127;
        uint16_t Word128;
        uint16_t Word129;

        uint16_t Word130;
        uint16_t Word131;
        uint16_t Word132;
        uint16_t Word133;
        uint16_t Word134;
        uint16_t Word135;
        uint16_t Word136;
        uint16_t Word137;
        uint16_t Word138;
        uint16_t Word139;

        uint16_t Word140;
        uint16_t Word141;
        uint16_t Word142;
        uint16_t Word143;
        uint16_t Word144;
        uint16_t Word145;
        uint16_t Word146;
        uint16_t Word147;
        uint16_t Word148;
        uint16_t Word149;

        union {
            uint16_t VendorUniqueTDSupport; // 150
            uint16_t Word150;
        };
        uint16_t Word151;
        uint16_t Word152;
        uint16_t Word153;
        uint16_t Word154;
        uint16_t Word155;
        uint16_t Word156;
        uint16_t Word157;
        uint16_t Word158;
        uint16_t Word159;

        uint16_t Word160;
        uint16_t Word161;
        uint16_t Word162;
        uint16_t Word163;
        uint16_t Word164;
        uint16_t Word165;
        uint16_t Word166;
        uint16_t Word167;
        uint16_t Word168;
        uint16_t Word169;

        uint16_t Word170;
        uint16_t Word171;
        uint16_t Word172;
        uint16_t Word173;
        uint16_t Word174;
        uint16_t Word175;
        uint16_t Word176;
        uint16_t Word177;
        uint16_t Word178;
        uint16_t Word179;

        uint16_t Word180;
        uint16_t Word181;
        uint16_t Word182;
        uint16_t Word183;
        uint16_t Word184;
